Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиРасчетаРыночнойСтавкиПоВидамАктивов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СхемаПроверкиСущественностиОтклонений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОпределенияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодичностиОпределенияРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьТолькоПриПервоначальномПризнании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаБанков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыБанковДляПолученияРыночнойПроцентнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляОтбораРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаСрокаДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаСрокаДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыШкалСредневзвешенныхПроцентныхСтавковПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПолученияКлючевойСтавкиЗаПериодДействияСредневзвешенойСтавкиПоДепозитам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантПолученияДатыКлючевойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДатыСобытийПриПримененииРыночнойСтавки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантыРасчетаРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаРыночнойСтавкиПоДепозитамНФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляПроверкиНаРыночность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиВПроцентныхПунктах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникТаблицыСоответствияРейтингов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтклонениеКредитногоСпреда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантОтклоненияОтРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроцентнаяСтавка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПоказыватьОтрицательныеПроценты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСтавкиДляРасчетаДисконтированногоПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПроцентныхСтавокДляРасчетаСтоимостиДепозитныхВкладов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьЭСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверкаНаРыночностьПоПеречнюЦБ580П</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодНаблюдаемыхПроцентныхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СмещениеСтандартногоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьОценки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьРасчетаКорректировкиЭСП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПереоценкиАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьЛинейноНерыночныеАктивы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьНастройкиНаДатуРазмещенияАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьИзменениеКлючевойСтавки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантРасчетаКоэффициентаВолатильности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаКоэффициентаВолатильности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСредневзвешеннойРыночнойСтавки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредневзвешенныхСтавок</v8:Type>
						<v8:Type>cfg:CatalogRef.БиржевыеИндексы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочностьГраницДиапазонаРыночнойСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйСрокАктиваДляИспользованияСхемы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыРасчетаОценочнойСтоимости</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:DocumentRef.МНО</v8:Type>
						<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦельРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦелиРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивовДляПроверкиНаРыночность</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеСтоимостиПоЭСППоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКлючевойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроверять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчитатьПоРыночнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛинейноИПоФактическойЭСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетПоМетодикеКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КБДИMosPrime1День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетНеРеализован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаПрекратилаДействие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыАктивовДляПроверкиНаРыночность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыАктивовДляПроверкиНаРыночность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямоеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбратноеРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДебиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыВыданные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаймыПолученные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КредиторскаяЗадолженностьПоДолгосрочнойАренде</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КриваяБезрисковойДоходности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоэффициентВолатильностиРычнонойСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтандартноеОтклонениеПоГенеральнойСовокупности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/НастройкиРасчетаРыночнойСтавкиПоВидамАктивов/Ext/ManagerModule.bsl
Функция ПолучитьМассивДоступныхСхем(ВидАктива) Экспорт
	
	МассивДоступныхСхем = Новый Массив;
	
	Для Каждого Схема Из Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам Цикл
		
		СхемаДоступна = Истина;
		
		Если Схема = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагент
			ИЛИ Схема = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночная
		Тогда
		
			СхемаДоступна =
				(ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО
				ИЛИ ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО
				ИЛИ ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.Депозиты);
				
		ИначеЕсли Схема = Перечисления.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов Тогда
				
			СхемаДоступна =
				(ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ПрямоеРЕПО
				ИЛИ ВидАктива = Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО);
				
		КонецЕсли;
		
		Если СхемаДоступна Тогда
			МассивДоступныхСхем.Добавить(Схема);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат МассивДоступныхСхем;
	
КонецФункции

Функция ИспользуемыеИзмеренияИРесурсы(Запись) Экспорт
	
	СписокИспользуемыхИзмеренийИРесурсов = Новый СписокЗначений;
	
#Область Измерения

	Для Каждого Измерение Из Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Измерения Цикл
		СписокИспользуемыхИзмеренийИРесурсов.Добавить(Измерение.Имя, Измерение.Представление(), Истина); //Измерения по умолчанию используются
	КонецЦикла; 

	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидКонтрагента").Пометка = ВидыАктивовЗависимыеОтВидаКонтрагента().Найти(Запись.ВидАктива) <> Неопределено;

#КонецОбласти	

	Для Каждого Ресурс Из Метаданные.РегистрыСведений.НастройкиРасчетаРыночнойСтавкиПоВидамАктивов.Ресурсы Цикл
		СписокИспользуемыхИзмеренийИРесурсов.Добавить(Ресурс.Имя, Ресурс.Представление(), Ложь); //Ресурсы по умолчанию не используются
	КонецЦикла; 

	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("СхемаПроверкиСущественностиОтклонений").Пометка = Истина;  // всегда используется
	
	Если Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетНеРеализован")
	 ИЛИ Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НастройкаПрекратилаДействие") Тогда
		Возврат СписокИспользуемыхИзмеренийИРесурсов;
	КонецЕсли;
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИспользоватьНастройкиНаДатуРазмещенияАктива").Пометка = Истина;
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодичностьОпределенияРыночнойСтавки").Пометка = Истина;
	
#Область СхемаПроверкиСущественностиОтклонений

	Если Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.НеПроверять") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантРасчетаСрокаДляПримененияРыночнойСтавки").Пометка	= (НЕ Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(Запись.ПериодичностьОпределенияРыночнойСтавки));
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокАктиваДляИспользованияСхемы").Пометка 	= Истина;
		Возврат СписокИспользуемыхИзмеренийИРесурсов; //остальные ресурсы не используются
		
	ИначеЕсли Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.РасчетПоМетодикеКлиента") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантРасчетаСрокаДляПримененияРыночнойСтавки").Пометка	= (НЕ Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(Запись.ПериодичностьОпределенияРыночнойСтавки));
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляПроверкиНаРыночность").Пометка									= Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП").Пометка															= Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьГраницДиапазонаРыночнойСтавки").Пометка								= Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения").Пометка = Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета").Пометка			= Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСредневзвешеннойРыночнойСтавки").Пометка									= Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляРасчетаДисконтированногоПотока").Пометка							= Истина;
		
		Если Запись.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодичностьОценки").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодичностьРасчетаКорректировкиЭСП").Пометка = Истина;
		КонецЕсли;
		
		Возврат СписокИспользуемыхИзмеренийИРесурсов; //остальные ресурсы не используются
		
	КонецЕсли;
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета").Пометка = Истина;
	
#Область ВидАктива
	Если Запись.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодичностьОценки").Пометка = Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодичностьРасчетаКорректировкиЭСП").Пометка = Истина;
	КонецЕсли;
#КонецОбласти
	
	Если Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагент") Тогда
		
		Если Запись.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляПроверкиНаРыночность").Пометка = Истина;
		КонецЕсли;	
			
		Возврат СписокИспользуемыхИзмеренийИРесурсов; //остальные ресурсы не используются
		
	ИначеЕсли Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЛинейноИПоФактическойЭСП") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляРасчетаДисконтированногоПотока").Пометка = Истина;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП").Пометка = Истина;
		Возврат СписокИспользуемыхИзмеренийИРесурсов; //остальные ресурсы не используются
		
	ИначеЕсли Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИлиОтклонениеСтоимостиПоРыночнойСтавке") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП").Пометка = Истина;
	
	ИначеЕсли Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.СтавкаРыночнаяИОтклонениеСтоимостиПоЭСП") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП").Пометка = Истина;
	
	ИначеЕсли Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ОтклонениеСтоимостиПоЭСППоРыночнойСтавке") Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтСтоимостиПоЭСП").Пометка = Истина;
		
	КонецЕсли;
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МинимальныйСрокДоПогашенияДляПримененияРыночнойСтавки").Пометка 	= Истина;
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьРыночнойСтавки").Пометка									= Истина;
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьГраницДиапазонаРыночнойСтавки").Пометка					= Истина;
	
	ПоКлючевойСтавке 			= (Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПоКлючевойСтавке"));
	ПересчитатьПоРыночнойСтавке	= (Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ПересчитатьПоРыночнойСтавке"));
	БиржевойИндекс				= (ТипЗнч(Запись.ВидСредневзвешеннойРыночнойСтавки) = Тип("СправочникСсылка.БиржевыеИндексы"));                                                                       
	ЦКИлиШкалаИндексов 			= (Запись.СхемаПроверкиСущественностиОтклонений = ПредопределенноеЗначение("Перечисление.СхемыПроверкиСущественностиОтклоненийПоДепозитнымВкладам.ЦентральныйКонтрагентИлиСтавкаРыночнаяПоШкалеИндексов"));
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСредневзвешеннойРыночнойСтавки").Пометка				= (НЕ ПоКлючевойСтавке И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантОтклоненияОтРыночнойСтавки").Пометка 				= (НЕ ПересчитатьПоРыночнойСтавке);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИгнорироватьИзменениеКлючевойСтавки").Пометка 			= (НЕ ПоКлючевойСтавке И НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("РассчитыватьЛинейноНерыночныеАктивы").Пометка 			= (НЕ ПересчитатьПоРыночнойСтавке И Запись.ВидАктива = ПредопределенноеЗначение("Перечисление.ВидыАктивовДляПроверкиНаРыночность.Депозиты"));
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляПроверкиНаРыночность").Пометка				= (НЕ ПоКлючевойСтавке И НЕ ПересчитатьПоРыночнойСтавке); //для ключевой не реализована функциональность
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляРасчетаДисконтированногоПотока").Пометка		= (НЕ ПоКлючевойСтавке И НЕ ПересчитатьПоРыночнойСтавке);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП").Пометка 									= (НЕ ПоКлючевойСтавке И НЕ ПересчитатьПоРыночнойСтавке);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("НеПоказыватьОтрицательныеПроценты").Пометка 				= (НЕ ПересчитатьПоРыночнойСтавке И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроверкаНаРыночностьПоПеречнюЦБ580П").Пометка 			= (НЕ ПересчитатьПоРыночнойСтавке И НЕ ЦКИлиШкалаИндексов);
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияРыночнойСтавки").Пометка 				= (НЕ ПересчитатьПоРыночнойСтавке); 
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("МаксимальныйСрокДоПогашенияДляПримененияЛинейногоРасчета").Пометка 			= (НЕ ПоКлючевойСтавке И НЕ ПересчитатьПоРыночнойСтавке); //для ключевой не реализована функциональность
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИспользованиеРыночнойСтавкиБезУчетаПроцентаСущественностиОтклонения").Пометка = (НЕ ПересчитатьПоРыночнойСтавке);
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияКлючевойСтавки").Пометка 		= (НЕ ПоКлючевойСтавке И НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантыРасчетаРыночнойСтавки").Пометка 		= (НЕ ПоКлючевойСтавке И НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияДатыКлючевойСтавки").Пометка 	= (НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ГруппаБанков").Пометка 				= (НЕ ПоКлючевойСтавке И НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидШкалы").Пометка					= (НЕ ПоКлючевойСтавке И НЕ БиржевойИндекс И НЕ ЦКИлиШкалаИндексов);

#КонецОбласти

#Область ПериодичностьОпределенияРыночнойСтавки
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантРасчетаСрокаДляОтбораРыночнойСтавки").Пометка		= (НЕ ПоКлючевойСтавке
																													И НЕ БиржевойИндекс
																													И НЕ Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(Запись.ПериодичностьОпределенияРыночнойСтавки)); //для ключевой не реализована функциональность
	
	СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантРасчетаСрокаДляПримененияРыночнойСтавки").Пометка	= (НЕ Справочники.ПериодичностиОпределенияРыночнойСтавки.ПроверкаТолькоПриПервоначальномПризнании(Запись.ПериодичностьОпределенияРыночнойСтавки)); //для ключевой не реализована функциональность
#КонецОбласти

#Область ИгнорироватьИзменениеКлючевойСтавки 
	Если СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИгнорироватьИзменениеКлючевойСтавки").Пометка
	   И Запись.ИгнорироватьИзменениеКлючевойСтавки
	   ИЛИ БиржевойИндекс Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияКлючевойСтавки").Пометка = Ложь;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияДатыКлючевойСтавки").Пометка = Ложь;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантыРасчетаРыночнойСтавки").Пометка = Ложь;
	КонецЕсли;
#КонецОбласти

#Область ВариантОтклоненияОтРыночнойСтавки 

	Если СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантОтклоненияОтРыночнойСтавки").Пометка = Истина Тогда
		Если Запись.ВариантОтклоненияОтРыночнойСтавки = ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КриваяБезрисковойДоходности") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИсточникТаблицыСоответствияРейтингов").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ОтклонениеКредитногоСпреда").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияКлючевойСтавки").Пометка = Ложь;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантПолученияДатыКлючевойСтавки").Пометка = Ложь;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантыРасчетаРыночнойСтавки").Пометка = Ложь;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ИгнорироватьИзменениеКлючевойСтавки").Пометка = Ложь;
		
		ИначеЕсли Запись.ВариантОтклоненияОтРыночнойСтавки = ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.Фиксированный") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиОтклоненияОтРыночнойСтавки").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиВПроцентныхПунктах").Пометка = Истина;
			
		ИначеЕсли Запись.ВариантОтклоненияОтРыночнойСтавки = ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.СтандартноеОтклонениеПоГенеральнойСовокупности") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодНаблюдаемыхПроцентныхСтавок").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("СмещениеСтандартногоОтклонения").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПроцентСущественностиВПроцентныхПунктах").Пометка = Истина;
			
		ИначеЕсли Запись.ВариантОтклоненияОтРыночнойСтавки = ПредопределенноеЗначение("Перечисление.ВариантыОтклоненияОтРыночнойСтавкиПоДепозитнымВкладам.КоэффициентВолатильностиРычнонойСтавки") Тогда
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ПериодНаблюдаемыхПроцентныхСтавок").Пометка = Истина;
			СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВариантРасчетаКоэффициентаВолатильности").Пометка = Истина;
			
		КонецЕсли;
	КонецЕсли;
#КонецОбласти
	
#Область РассчитыватьЛинейноНерыночныеАктивы
	Если СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("РассчитыватьЛинейноНерыночныеАктивы").Пометка
	   И Запись.РассчитыватьЛинейноНерыночныеАктивы Тогда
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляПроверкиНаРыночность").Пометка = Ложь;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ВидСтавкиДляРасчетаДисконтированногоПотока").Пометка = Ложь;
		СписокИспользуемыхИзмеренийИРесурсов.НайтиПоЗначению("ТочностьЭСП").Пометка = Ложь;
	КонецЕсли;	
#КонецОбласти

	Возврат СписокИспользуемыхИзмеренийИРесурсов;
	
КонецФункции

Функция ВидыАктивовЗависимыеОтВидаКонтрагента() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Перечисления.ВидыАктивовДляПроверкиНаРыночность.ДебиторскаяЗадолженность);
	Результат.Добавить(Перечисления.ВидыАктивовДляПроверкиНаРыночность.ЗаймыВыданные);
	Результат.Добавить(Перечисления.ВидыАктивовДляПроверкиНаРыночность.ОбратноеРЕПО);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеБиржевогоИндексаДляСделкиРЕПО(СделкаРЕПО) Экспорт
	
	РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СделкаРЕПО, "Дата, ВалютаСделки, Рынок, ДатаВторойЧастиРЕПО, СчетДоверительногоУправления");
	
	// Эта шкала индексов пока используется только у группы Будущее, поэтому исключим случайную установку настройки другому клиенту	
	Если Не БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(РеквизитыСделки.СчетДоверительногоУправления, РеквизитыСделки.Дата) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Проверка сделки РЕПО на рыночность по шкале индексов используется только у Группы Будущее. 
					|Необходимо проверить настройки расчета активов по рыночной ставке у счета ДУ %1", 
					РеквизитыСделки.СчетДоверительногоУправления), 
			РеквизитыСделки.СчетДоверительногоУправления);
			
		Возврат Неопределено;
		
	КонецЕсли;
	
	КодыИндексов = "";
	Если РеквизитыСделки.ВалютаСделки = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль") Тогда
		КодыИндексов = "RUSFAR,RUSFAR1W,RUSFAR2W,RUSFAR1M,RUSFAR3M";
	ИначеЕсли РеквизитыСделки.ВалютаСделки = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_юань") Тогда
		КодыИндексов = "RUSFARCNY,RUSFARCN1W";		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для валюты %1 в методике не заданы биржевые индексы для сделок РЕПО", РеквизитыСделки.ВалютаСделки));
		Возврат Неопределено; 
	КонецЕсли;
		
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗначенияБиржевыхИндексов.БиржевойИндекс КАК БиржевойИндекс,
		|	ЗначенияБиржевыхИндексов.Валюта КАК Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации) КАК Рынок,
		|	ВЫБОР
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Код = ""RUSFAR2W""
		|			ТОГДА 14
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Код = ""RUSFAR1M""
		|			ТОГДА 30
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Код = ""RUSFAR3M""
		|			ТОГДА 90
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Код В (""RUSFAR"",""RUSFARCNY"")
		|			ТОГДА 1
		|		КОГДА ЗначенияБиржевыхИндексов.БиржевойИндекс.Код В (""RUSFAR1W"",""RUSFARCN1W"")
		|			ТОГДА 7
		|	КОНЕЦ КАК Срок,
		|	ЗначенияБиржевыхИндексов.CLOSE КАК ЗначениеИндекса
		|ПОМЕСТИТЬ _ЗначенияИндексов
		|ИЗ
		|	РегистрСведений.ЗначенияБиржевыхИндексов КАК ЗначенияБиржевыхИндексов
		|ГДЕ
		|	ЗначенияБиржевыхИндексов.Период = &Период
		|	И ЗначенияБиржевыхИндексов.Биржа = &Биржа_ММВБ
		|	И ЗначенияБиржевыхИндексов.БиржевойИндекс.Код В(&КодыИндексов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	_ЗначенияИндексов.ЗначениеИндекса КАК ЗначениеИндекса,
		|	ВЫБОР
		|		КОГДА _ЗначенияИндексов.Срок - &Срок < 0
		|			ТОГДА &Срок - _ЗначенияИндексов.Срок
		|		ИНАЧЕ _ЗначенияИндексов.Срок
		|	КОНЕЦ КАК БлижайшийСрок
		|ИЗ
		|	_ЗначенияИндексов КАК _ЗначенияИндексов
		|ГДЕ
		|	_ЗначенияИндексов.Рынок = &Рынок
		|
		|УПОРЯДОЧИТЬ ПО
		|	БлижайшийСрок");
	
	Запрос.УстановитьПараметр("Биржа_ММВБ", 	ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ"));
	Запрос.УстановитьПараметр("Период",			НачалоДня(РеквизитыСделки.Дата));
	Запрос.УстановитьПараметр("Срок",			(РеквизитыСделки.ДатаВторойЧастиРЕПО - НачалоДня(РеквизитыСделки.Дата)) / (24 * 60 * 60));
    Запрос.УстановитьПараметр("КодыИндексов",	СтрРазделить(КодыИндексов, ","));
	Запрос.УстановитьПараметр("Рынок",			РеквизитыСделки.Рынок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗначениеИндекса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
